UNF16.RetailCRMИнтеграция/src/DataProcessors/crm_RetailCRMОбработка/crm_RetailCRMОбработка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>crm_RetailCRMОбработка</name>
  <attributes>
    <name>ЗагружатьЗаказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьЗаказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТипыЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоОрганизаций</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТипыЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданиеОплат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаОплатВCRM</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданиеРеализаций</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GUIDОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорпоративныеКлиенты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКНастройкам</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТипыДоставок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>since_Id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>offers_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаботаСРозницей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьЧеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьЧекиНаВозврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаЛояльностиРозница</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдКлиентаПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОформленияРозница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПЛНачислитьСоСписанием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПЛНеСписыватьСоСкидками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Эталонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаБроней</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданиеВозвратов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючCRM</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодМагазина</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСпособыОформленияЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьЗагрузкуЗаказовПоСпособуОформления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОстаткиСУчетомРезервов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабКонстанты</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>CatalogRef</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабСтатусы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗаказа</name>
      <type>
        <types>CatalogRef.СостоянияЗаказовПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Отгрузка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отмена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перемещение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Резервирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаСтатуса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеЗагружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Возврат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Производство</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабСтатусыТоваров</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Производство</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Возврат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отмена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабСтатусыСостояния</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияЗаказовПокупателей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабМенеджеры</name>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабСклады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабОрганизации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодМагазина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьОстатки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабТипыЦен</name>
    <attributes>
      <name>ТипЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>КодCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабТипыОплат</name>
    <attributes>
      <name>КодCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплатыРозница</name>
      <type>
        <types>EnumRef.ВидыБезналичныхОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличнаяОплатаРозница</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабТипыДоставок</name>
    <attributes>
      <name>КодCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>EnumRef.СпособыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Перевозчик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладДоставки</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабКаталог</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабСпособыОформления</name>
    <attributes>
      <name>КодCRM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>CatalogRef.ИсточникиПривлеченияПокупателей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

UNF16.RetailCRMИнтеграция/src/DataProcessors/crm_RetailCRMОбработка/Forms/НачальнаяСтраница/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Попытка
		
		ИмяСервера 	= 	СокрЛП(crm_RetailCRMОбщийВызовСервера.ПолучитьЗначениеКонстанты("ИмяСервера"));
		ApiKey		=	СокрЛП(crm_RetailCRMОбщийВызовСервера.ПолучитьЗначениеКонстанты("КлючCRM"));
		КодМагазина	=   СокрЛП(crm_RetailCRMОбщийВызовСервера.ПолучитьЗначениеКонстанты("КодМагазина"));
		
	Исключение
		
		ИмяСервера = "";
		ApiKey = "";
		КодМагазина = "";
		
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИмяСервера) ИЛИ НЕ ЗначениеЗаполнено(ApiKey) ИЛИ НЕ ЗначениеЗаполнено(КодМагазина) Тогда
		 
		Если ЗначениеЗаполнено(ApiKey) Тогда
			Объект.КлючCRM = ApiKey;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяСервера) Тогда
			Объект.ИмяСервера = ИмяСервера;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодМагазина) Тогда
			Объект.КодМагазина = КодМагазина;
		КонецЕсли;
		
		Элементы.НачатьРаботу.Доступность = Ложь;
		УстановитьПользователяПоУмолчанию();
		
	Иначе
		
		 Закрыть();
		 ОткрытьФорму("Обработка.crm_RetailCRMОбработка.Форма.УправляемаяФорма"
		 			,
		 			,
		 			,
		 			,
		 			,
		 			,
		 			, РежимОткрытияОкнаФормы.Независимый);
		 
	КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МагазинИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	НачатьРаботуДоступностьИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	
	НачатьРаботуДоступностьИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура СайтRetailCRMИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	НачатьРаботуДоступностьИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура СайтRetailCRMПриИзменении(Элемент)
	
	НачатьРаботуДоступностьИзменение(); 
	
КонецПроцедуры

&НаКлиенте
Процедура КлючAPIПриИзменении(Элемент)
	
	НачатьРаботуДоступностьИзменение();
	
КонецПроцедуры

&НаКлиенте
Процедура КлючAPIИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	НачатьРаботуДоступностьИзменение();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьРаботу(Команда)
	
	Попытка	
		
		Ответ = crm_RetailCRMОбщийВызовСервера.HTTPзапросGET(СокрЛП(Объект.ИмяСервера)
																 , "/api/credentials?apiKey=" + СокрЛП(Объект.КлючCRM));
		Ответ = crm_RetailCRMОбщийВызовСервера.UnJSONTest(Ответ);
		
		Если Ответ["success"] Тогда 
			Если типзнч(Ответ["sitesAvailable"]) = тип("Массив") Тогда
				НайдМагазин = Ответ["sitesAvailable"].Найти(СокрЛП(Объект.КодМагазина));
				Если НайдМагазин = Неопределено Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для данного Api-Ключа не разрешено использование указанного магазина!'"));
					Возврат;
				КонецЕсли;
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для данного Api-Ключа не разрешено использование указанного магазина!'"));	
				Возврат;	
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Произошла ошибка при попытке проверки введенных данных, проверьте пожалуйста введенные данные!'"));
		Возврат;
		
	КонецПопытки;
	
	ЗагрузитьТабличныеЧасти();
	СохранитьКонстантыНаСервере();
	Закрыть();
	ОткрытьФорму("Обработка.crm_RetailCRMОбработка.Форма.УправляемаяФорма"
				,
				,
				,
				,
				,
				,
				, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура НачатьРаботуДоступностьИзменение()
	
	Если ЗначениеЗаполнено(Объект.КодМагазина)  И Объект.КодМагазина	<> " " 
	   И ЗначениеЗаполнено(Объект.ИмяСервера)	И Объект.ИмяСервера 	<> " " 
	   И ЗначениеЗаполнено(Объект.КлючCRM) 		И Объект.КлючCRM 		<> " " Тогда 
			
		Элементы.НачатьРаботу.Доступность = Истина;
	Иначе
		Элементы.НачатьРаботу.Доступность = Ложь;	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура СохранитьКонстантыНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.Мод_СохранитьКонстанты();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТабличныеЧасти()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ЗаполнитьТабличныеЧасти(Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПользователяПоУмолчанию()
	
	Если Константы.crm_УчтенаяЗаписьСКонстантами.Получить() = Справочники.Пользователи.ПустаяСсылка() Тогда
		Константы.crm_УчтенаяЗаписьСКонстантами.Установить(Пользователи.ТекущийПользователь());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
